## Database Connection

Run following command to connect to database. You should see "Connected to ..." for successful connection.

In [1]:
# connect to db in public repo
ib.connect_db('ib://ewu/w4111-public/databases/w4111')

Connected to: ib://ewu/w4111-public/databases/w4111

In [3]:
ib.connect_db("postgresql://student:w4111student@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111")

Connected to: postgresql://student:w4111student@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111

We are using a 1mil-tuple sample** of the iowa liquor sales data for this assignment, with column names and datatype (in format of [name] [datatype]) as:

  - address char(256),
  - bottle_volume_ml integer,
  - category char(256),
  - category_name char(256),
  - city char(256),
  - county char(256),
  - county_number char(256),
  - date date,
  - im_desc char(256),
  - invoice_line_no char(256),
  - itemno integer,
  - name char(256),
  - pack integer,
  - sale_bottles integer,
  - sale_dollars double precision,
  - sale_gallons double precision,
  - sale_liters double precision,
  - state_bottle_cost double precision,
  - state_bottle_retail double precision,
  - store integer,
  - store_location char(256),
  - store_location_address char(256),
  - store_location_city char(256),
  - store_location_zip char(256),
  - vendor_name char(256),
  - vendor_no integer,
  - zipcode text
  
A description of column names can be found here: https://data.iowa.gov/Economy/Iowa-Liquor-Sales/m3tr-qhgy.

In [ ]:
%%sql
select * from iowa limit 1;

## Part I: SQL, the sequel

### Which store had the second most sales in terms of total records in the table?

In [4]:
%%sql
WITH temp as (
SELECT store, 
count (*) as num 
FROM iowa group by store order by num desc
)
SELECT store, num
FROM temp 
WHERE num = (SELECT max(num) 
             FROM temp 
             WHERE num < (SELECT max(num) 
                          FROM temp))

1 rows affected.

   store   num
0   2190  7802

### At the store with the second most total records (you may use the answer for Q1.1), what was the vendor number with most sale records? (The vendor that has the most records in the table?)

In [5]:
%%sql

WITH temp as (
    SELECT vendor_no, 
    count (vendor_no) as num 
    FROM iowa 
    WHERE store=2190 
    GROUP BY vendor_no  
    ORDER BY num 
    DESC LIMIT 1)
SELECT vendor_no,num FROM temp;

1 rows affected.

   vendor_no   num
0        260  1393

### For the store 2130, 2152, 2190 and 2191, write a query to find the most purchased sale_bottles one time (for each row, we regard it as one time)
To be done without using aggregations

In [98]:
%%sql
SELECT i1.store, i1.sale_bottles FROM iowa i1 WHERE NOT EXISTS (SELECT * FROM iowa i2 WHERE i1.sale_bottles < i2.sale_bottles and i1.store=2130 and i2.store=2130) and i1.store=2130
UNION
SELECT i1.store, i1.sale_bottles FROM iowa i1 WHERE NOT EXISTS (SELECT * FROM iowa i2 WHERE i1.sale_bottles < i2.sale_bottles and i1.store=2152 and i2.store=2152) and i1.store=2152
UNION
SELECT i1.store, i1.sale_bottles FROM iowa i1 WHERE NOT EXISTS (SELECT * FROM iowa i2 WHERE i1.sale_bottles < i2.sale_bottles and i1.store=2190 and i2.store=2190) and i1.store=2190
UNION
SELECT i1.store, i1.sale_bottles FROM iowa i1 WHERE NOT EXISTS (SELECT * FROM iowa i2 WHERE i1.sale_bottles < i2.sale_bottles and i1.store=2191 and i2.store=2191) and i1.store=2191
ORDER BY store

  store sale_bottles
0  2130          600
1  2152           36
2  2190          480
3  2191          540

### This problem has two steps, you only need to return the value from second step

__Compute the set of all liquors with the characters "tequila" (in lowercase) in its description (`im_desc`). The attribute `itemno` is the one that can serve as a unique identifier for a specific liquor.__

__Return the count of all distinct value of zipcode for all liquor stores that sold at least two of every tequila as defined in the previous sentence.__

In [17]:
%%sql
with temp as (
select zipcode, store, itemno, sum(sale_bottles) as bottles_sold
from iowa
where im_desc like '%tequila%'
group by store, zipcode, itemno
having sum(sale_bottles) >= 2
)
select count(distinct zipcode)
from 
(
select t1.zipcode, count(distinct t1.itemno) as dis_count, t1.store
    from temp t1 
    group by t1.zipcode,t1.store
    having count(distinct t1.itemno) = (select count(distinct t2.itemno) from temp t2)
) as foo

  count
0   110

### Compute the median itemno for the store you get in Q1.1

In [30]:
%%sql
with temp as (
select itemno, count(1) as count
from iowa
where store = 2190
group by itemno
order by itemno
)
select itemno from 
(select itemno,count, sum(count) over (ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) as cumcount 
from temp) as foo where foo.cumcount >= (select sum(count)/2 from temp) limit 1

  itemno
0  41078